/****************************************
技巧10:打印杨辉三角
本质特征：它的两条斜边都是由数字1组成的，而其余的数则是等于它肩上的两个数之和。
****************************************/
#include <stdio.h>
#include <windows.h>
int main(int argc, char *argv[])
 {
	int i, j, a[11][11];

	// 两条斜边都为1
	for (i=1; i<11; i++)
	{
		a[i][i]= 1;
		a[i][1]= 1;
	}

	// 其余的数等于它肩上的两个数之和
	for (i=3; i<11; i++)
	{
		for (j=2; j<=i-1; j++)
		{
			a[i][j]=a[i-1][j-1]+a[i-1][j];
		}
	}

	//输出
	for (i=1; i<11; i++)
	{
		for (j=1; j<=i; j++)
			printf ("%4d\t",a[i][j]);
		printf ("\n");
	}

	return 0;
 }
     